#+title: CSC Project Program Rust Workshop
#+author: Daniel Liu

* Why Rust

#+begin_src rust
  fn main() {
      println!("hello from rust!");
  }
#+end_src

#+RESULTS:
: hello from rust!

- safe: borrow checker ensures memory safety
- (blazenly) fast: llvm backend for compiler optimization
- compile time chceks: rust attempts to move as many things as possible to
  compile time, so the compiler can catch mistakes much faster
- developer tooling: great developer experience, with official tools for testing,
  linting, language server support, documentation generation and much more
- cross-platform
- fun to write

* 1. Hello world

#+begin_src rust
  /// 1.rs

  fn main() {
      println!("hello from rust!");
  }
#+end_src

#+RESULTS:
: hello from rust!

What's new
- `main` function
- `println!` macro

* 2. Get environment variables

#+begin_src rust
  /// 2.rs

  fn main() {
      let args: Vec<String> = std::env::args().collect();
      println!("arguments {:?}", args);
  }
#+end_src

#+RESULTS:
: environment variables ["target/debug/cargoAwIqt5"]

What's new
- Variable declaration with let, followed with type declaration (can import modules using `use` keyword)
- Namespacing (with modules), using `::`
- `args()` returns an iterator (more on this later)
- Can use templating syntax inside `println!`

* 3. Structs

#+begin_src rust
  /// 3.rs

  pub struct Cli {
      pub program_name: String,
  }

  fn main() {
      let args: Vec<String> = std::env::args().collect();
      println!("arguments {:?}", args);

      let my_cli = Cli {
	  program_name: "my program".to_string(),
      };
  }
#+end_src

#+RESULTS:
: arguments ["target/debug/cargo2VKO7A"]

What's new
- Defining structs with fields
- Visibility (private by default, `pub` keyword)
- Why `to_string()`? (`String` type vs `&str`)

* 4. Functions on structs

#+begin_src rust
  /// 4.rs

  pub struct Cli {
      pub program_name: String,
  }

  impl Cli {
      pub fn run(&self, args: &Vec<String>) {
	  println!("[{}] {:?}", self.program_name, args);
      }
  }

  fn main() {
      let args = std::env::args().collect::<Vec<String>>();

      let my_cli = Cli {
	  program_name: "my program".to_string(),
      };
      my_cli.run(&args);
  }
#+end_src

#+RESULTS:
: [my program] ["target/debug/cargoHneTZ1"]

What's new
- `impl` block
- Taking `self` as an argument
- References
- Why no type annotation on `my_cli`? (turbofish provides explicit type for generic function)

* 6. Error handling

#+begin_src rust
  /// 6.rs

  pub struct Cli {
      pub program_name: String,
  }

  // Signature of `Result` type
  enum MyResult<T, E> {
      Ok(T),
      Err(E),
  }

  impl Cli {
      pub fn run(&self, args: &Vec<String>) -> Result<(), Box<dyn std::error::Error>> {
	  let argument: Option<&String> = args.get(1);

	  let arg_value = if let Some(arg) = argument {
	      println!("argument is {}", arg);
	      arg
	  } else {
	      println!("uh oh, we did not get an argument");
	      // What should we put in the ... ?
	      // return Err(...)
	      "error"
	  };

	  // do something with arg_value
	  println!("the value of arg_value is {}", arg_value);

	  Ok(())
      }
  }

  fn main() {
      let args = std::env::args().collect::<Vec<String>>();

      let my_cli = Cli {
	  program_name: "my program".to_string(),
      };
      my_cli.run(&args);
  }
#+end_src

#+RESULTS:
: error: Could not compile `cargoYtfxB6`.

What's new
- Blocks have return values
- `Result` type

Is there an easier way to convert from an `Option` to a `Result`?

* 11. Implementing build()

#+begin_src rust

  pub struct FlagBuilder {
      pub help: Option<String>,
      pub required: Option<bool>,
      pub long: String
      pub short: Option<char>,
  }

  impl FlagBuilder {
      pub fn new(long: String) -> Self {
	  FlagBuilder {
	      help: None,
	      required: None,
	      long,
	      short: None,
	  }
      }
      pub fn build(self) -> Result<Flag, CliError> {
	  Ok(Flag {
	      help: self.help.unwrap_or(String::new()),
	      required: self.required.unwrap_or(false),
	      long: self.long,
	      short: self.short,
	  })
      }
  }

  fn main() {
      let flag_1 = FlagBuilder::new("verbose".into())
	  .short('v')
	  .help("enable verbose logging mode".into())
	  .required()
	  .build();

      let flag_2 = FlagBuilder::new("help".into())
	  .short('h')
	  .build();
  }
#+end_src

#+RESULTS:
: error: Could not compile `cargoUp9fyP`.

What's new
- `unwrap_or()`
- What if we want to make something mandatory? Alternative with `new()` taking no parameters
- Notice that `build()` takes `self` instead of `&self`

** Part I: Basic parsing

#+begin_src rust

  #[derive(Default)]
  pub struct FlagParse {
      flags: Vec<Flag>,
      args: Vec<String>,
  }

  impl Cli {
      pub fn run(&self, args: &Vec<String>) -> Result<(), CliError> {
	  let mut flagparse = FlagParse::default();

	  let mut arg_it = args.iter();
	  arg_it.next().ok_or(CliError::NoProgramName)?;

	  for arg in arg_it {

	      // Decide if arg is a long flag, short flag, or a position argument
	      let flag: Option<&Flag> = if arg.starts_with("--") {
		  None
	      } else if arg.starts_with("-") {
		  None
	      } else {
		  flagparse.args.push(arg.to_owned());
		  continue;
	      };
	  }

	  Ok(())
      }
  }

#+end_src

#+RESULTS:
: error: Could not compile `cargo3p1pL9`.

What's new
- `Default` trait
- Iterators
- Blocks evaluate a value (continue and the `!` type)
- `to_owned()`

** Part II: Flag validity

#+begin_src rust

  #[derive(Clone)]
  pub struct Flag {
      pub help: String,
      pub required: bool,
      pub long: String,
      pub short: Option<char>,
  }

  #[derive(Default)]
  pub struct FlagParse {
      flags: Vec<Flag>,
      args: Vec<String>,
  }

  impl Cli {
      pub fn run(&self, args: &Vec<String>) -> Result<(), CliError> {
	  let mut flagparse = FlagParse::default();

	  let mut arg_it = args.iter();
	  arg_it.next().ok_or(CliError::NoProgramName)?;

	  for arg in arg_it {

	      // Decide if arg is a long flag, short flag, or a position argument
	      let flag: Option<&Flag> = if arg.starts_with("--") {
		  self.flags
		      .iter()
		      .find(|f| f.long == arg[2..].to_string())
	      } else if arg.starts_with("-") {
		  self.flags
		      .iter()
		      .find(|f| f.short == arg.chars().nth(1))
	      } else {
		  flagparse.args.push(arg.to_owned());
		  continue;
	      };

	      let flag: &Flag = if let Some(_flag) = flag {
		  _flag
	      } else {
		  return Err(CliError::InvalidFlag);
	      };

	      flagparse.flags.push(flag.clone());
	  }

	  Ok(())
      }
  }

#+end_src

#+RESULTS:
: error: Could not compile `cargoQVHbXo`.

What's new
- Iterator operations and lambdas
- Variable shadowing
- Need to add `#[derive(Clone)]` to `Flag` struct (can also use reference with lifetime annotation)

** Part III: Error handling

#+begin_src rust

  #[derive(Debug)]
  pub enum CliError {
      NoProgramName,
      InvalidFlag(String),
  }

  impl std::error::Error for CliError {}

  impl std::fmt::Display for CliError {
      fn fmt(&self, f: &mut std::fmt::Formatter) -> std::fmt::Result {
	  match self {
	      Self::NoProgramName => write!(f, "Program name not supplied"),
	      Self::InvalidFlag(v) => write!(f, "Invalid flag value: {}", v)
	  }
      }
  }

  impl Cli {
      pub fn run(&self, args: &Vec<String>) -> Result<(), CliError> {
	  let mut flagparse = FlagParse::default();

	  let mut arg_it = args.iter();
	  arg_it.next().ok_or(CliError::NoProgramName)?;

	  for arg in arg_it {

	      // Decide if arg is a long flag, short flag, or a position argument
	      let flag: Option<&Flag> = if arg.starts_with("--") {
		  self.flags
		      .iter()
		      .find(|f| f.long == arg[2..].to_string())
	      } else if arg.starts_with("-") {
		  self.flags
		      .iter()
		      .find(|f| f.short == arg.chars().nth(1))
	      } else {
		  flagparse.args.push(arg.to_owned());
		  continue;
	      };

	      let flag: &Flag = if let Some(_flag) = flag {
		  _flag
	      } else {
		  return Err(CliError::InvalidFlag(arg.to_owned()));
	      };

	      flagparse.flags.push(flag.clone());
	  }

	  Ok(())
      }
  }

#+end_src

#+RESULTS:
: error: Could not compile `cargoZ2zXKP`.

What's new
- Enum can hold values (enums are more like unions)

* 14. Get info from FlagParse

#+begin_src rust
  #[derive(Default)]
  pub struct FlagParse {
      flags: Vec<Flag>,
      args: Vec<String>,
  }

  impl FlagParse {

      pub fn get_flag(&self, long: &str) -> bool {
	  self.flags.iter().find(|f| f.long.eq(long)).is_some()
      }

      pub fn args(&self) -> &Vec<String> {
	  &self.args
      }

  }
#+end_src

#+RESULTS:
: error: Could not compile `cargokNbdNb`.

